In [63]:
import pandas as pd
import numpy as np
import seaborn as sns
import sklearn

In [64]:
df=pd.read_csv('titanic.csv')

In [65]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [66]:
df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [68]:
x=df['Age'].mean()

In [69]:
x

29.69911764705882

In [70]:
df['Age'].fillna(x,inplace=True)

In [71]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.000000,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.000000,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.000000,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.000000,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.000000,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.000000,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,29.699118,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.000000,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.000000,0,0,370376,7.7500,NaN,Q,0

In [72]:
df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [73]:
df.duplicated().value_counts()

False    891
dtype: int64

In [74]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,13.002015,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,22.000000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,29.699118,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,35.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [75]:
df.drop(['Name','Embarked','Cabin','Ticket','SibSp'],axis=1,inplace=True)

In [76]:
df.head()

   PassengerId  Pclass     Sex   Age  Parch     Fare  Survived
0            1       3    male  22.0      0   7.2500         0
1            2       1  female  38.0      0  71.2833         1
2            3       3  female  26.0      0   7.9250         1
3            4       1  female  35.0      0  53.1000         1
4            5       3    male  35.0      0   8.0500         0

In [77]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [78]:
df['Sex']=df['Sex'].map({'male':0, 'female':1})

In [79]:
df.head()

   PassengerId  Pclass  Sex   Age  Parch     Fare  Survived
0            1       3    0  22.0      0   7.2500         0
1            2       1    1  38.0      0  71.2833         1
2            3       3    1  26.0      0   7.9250         1
3            4       1    1  35.0      0  53.1000         1
4            5       3    0  35.0      0   8.0500         0

In [83]:
x = df.iloc[:, :-1]
y = df.iloc[:, 1]

In [84]:
x

     PassengerId  Pclass  Sex        Age  Parch     Fare
0              1       3    0  22.000000      0   7.2500
1              2       1    1  38.000000      0  71.2833
2              3       3    1  26.000000      0   7.9250
3              4       1    1  35.000000      0  53.1000
4              5       3    0  35.000000      0   8.0500
..           ...     ...  ...        ...    ...      ...
886          887       2    0  27.000000      0  13.0000
887          888       1    1  19.000000      0  30.0000
888          889       3    1  29.699118      2  23.4500
889          890       1    0  26.000000      0  30.0000
890          891       3    0  32.000000      0   7.7500

[891 rows x 6 columns]

In [85]:
y

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [86]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3 , random_state=42)

In [87]:
len(x_train)

623

In [88]:
len(y_train)

623

In [89]:
len(x_test)

268

In [90]:
len(y_test)

268

In [91]:
from sklearn.naive_bayes import GaussianNB

In [92]:

clf = GaussianNB()
clf.fit(x_train, y_train)

GaussianNB()

In [95]:
clf.score(x_train,y_train)

1.0

In [96]:
p=clf.predict(x_test)

In [97]:
p

array([3, 2, 3, 2, 3, 1, 3, 3, 3, 1, 1, 3, 3, 3, 2, 1, 1, 3, 2, 1, 3, 1,
       3, 3, 3, 3, 1, 2, 3, 3, 3, 3, 1, 3, 3, 3, 1, 3, 1, 3, 2, 3, 3, 3,
       3, 3, 3, 3, 3, 1, 3, 1, 3, 1, 3, 1, 2, 1, 2, 3, 3, 2, 2, 1, 3, 2,
       2, 3, 3, 1, 2, 1, 1, 1, 3, 3, 3, 1, 2, 3, 3, 2, 1, 3, 1, 1, 1, 1,
       1, 3, 3, 3, 1, 3, 3, 3, 1, 3, 2, 3, 1, 3, 1, 3, 3, 3, 2, 1, 3, 1,
       1, 3, 1, 1, 1, 3, 1, 2, 2, 3, 2, 1, 1, 2, 3, 1, 1, 1, 3, 3, 3, 3,
       2, 3, 1, 3, 1, 3, 3, 3, 3, 2, 2, 2, 3, 2, 2, 2, 1, 3, 3, 3, 3, 3,
       3, 3, 3, 3, 2, 3, 3, 1, 2, 1, 3, 1, 2, 1, 3, 3, 1, 2, 1, 3, 3, 3,
       3, 2, 3, 1, 2, 3, 3, 3, 1, 1, 2, 3, 1, 2, 3, 2, 3, 3, 2, 1, 1, 2,
       1, 3, 3, 3, 2, 3, 3, 3, 3, 1, 3, 3, 1, 3, 1, 3, 3, 3, 2, 1, 2, 3,
       3, 2, 3, 1, 3, 2, 3, 1, 2, 3, 2, 1, 3, 3, 3, 3, 1, 3, 1, 2, 3, 2,
       3, 3, 3, 3, 3, 3, 3, 1, 3, 2, 3, 3, 1, 3, 3, 1, 2, 2, 1, 1, 2, 3,
       1, 1, 3, 1], dtype=int64)

In [98]:
from sklearn.metrics import accuracy_score
acc=accuracy_score(y_test,p)

In [99]:
acc

1.0